PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_crypto_v2_1.h
/* CRYPTO_V2.CTL */
#define CRYPTO_V2_CTL_P_Pos                     0UL
#define CRYPTO_V2_CTL_P_Msk                     0x1UL
#define CRYPTO_V2_CTL_NS_Pos                    1UL
#define CRYPTO_V2_CTL_NS_Msk                    0x2UL
#define CRYPTO_V2_CTL_PC_Pos                    4UL
#define CRYPTO_V2_CTL_PC_Msk                    0xF0UL
#define CRYPTO_V2_CTL_ECC_EN_Pos                16UL
#define CRYPTO_V2_CTL_ECC_EN_Msk                0x10000UL
#define CRYPTO_V2_CTL_ECC_INJ_EN_Pos            17UL
#define CRYPTO_V2_CTL_ECC_INJ_EN_Msk            0x20000UL
#define CRYPTO_V2_CTL_ENABLED_Pos               31UL
#define CRYPTO_V2_CTL_ENABLED_Msk               0x80000000UL
/* CRYPTO_V2.RAM_PWR_CTL */
#define CRYPTO_V2_RAM_PWR_CTL_PWR_MODE_Pos      0UL
#define CRYPTO_V2_RAM_PWR_CTL_PWR_MODE_Msk      0x3UL
/* CRYPTO_V2.RAM_PWR_DELAY_CTL */
#define CRYPTO_V2_RAM_PWR_DELAY_CTL_UP_Pos      0UL
#define CRYPTO_V2_RAM_PWR_DELAY_CTL_UP_Msk      0x3FFUL
/* CRYPTO_V2.ECC_CTL */
#define CRYPTO_V2_ECC_CTL_WORD_ADDR_Pos         0UL
#define CRYPTO_V2_ECC_CTL_WORD_ADDR_Msk         0x1FFFUL
#define CRYPTO_V2_ECC_CTL_PARITY_Pos            25UL
#define CRYPTO_V2_ECC_CTL_PARITY_Msk            0xFE000000UL
/* CRYPTO_V2.ERROR_STATUS0 */
#define CRYPTO_V2_ERROR_STATUS0_DATA32_Pos      0UL
#define CRYPTO_V2_ERROR_STATUS0_DATA32_Msk      0xFFFFFFFFUL
/* CRYPTO_V2.ERROR_STATUS1 */
#define CRYPTO_V2_ERROR_STATUS1_DATA24_Pos      0UL
#define CRYPTO_V2_ERROR_STATUS1_DATA24_Msk      0xFFFFFFUL
#define CRYPTO_V2_ERROR_STATUS1_IDX_Pos         24UL
#define CRYPTO_V2_ERROR_STATUS1_IDX_Msk         0x7000000UL
#define CRYPTO_V2_ERROR_STATUS1_VALID_Pos       31UL
#define CRYPTO_V2_ERROR_STATUS1_VALID_Msk       0x80000000UL
/* CRYPTO_V2.INTR */
#define CRYPTO_V2_INTR_INSTR_FF_LEVEL_Pos       0UL
#define CRYPTO_V2_INTR_INSTR_FF_LEVEL_Msk       0x1UL
#define CRYPTO_V2_INTR_INSTR_FF_OVERFLOW_Pos    1UL
#define CRYPTO_V2_INTR_INSTR_FF_OVERFLOW_Msk    0x2UL
#define CRYPTO_V2_INTR_TR_INITIALIZED_Pos       2UL
#define CRYPTO_V2_INTR_TR_INITIALIZED_Msk       0x4UL
#define CRYPTO_V2_INTR_TR_DATA_AVAILABLE_Pos    3UL
#define CRYPTO_V2_INTR_TR_DATA_AVAILABLE_Msk    0x8UL
#define CRYPTO_V2_INTR_PR_DATA_AVAILABLE_Pos    4UL
#define CRYPTO_V2_INTR_PR_DATA_AVAILABLE_Msk    0x10UL
#define CRYPTO_V2_INTR_INSTR_OPC_ERROR_Pos      16UL
#define CRYPTO_V2_INTR_INSTR_OPC_ERROR_Msk      0x10000UL
#define CRYPTO_V2_INTR_INSTR_CC_ERROR_Pos       17UL
#define CRYPTO_V2_INTR_INSTR_CC_ERROR_Msk       0x20000UL
#define CRYPTO_V2_INTR_BUS_ERROR_Pos            18UL
#define CRYPTO_V2_INTR_BUS_ERROR_Msk            0x40000UL
#define CRYPTO_V2_INTR_TR_AP_DETECT_ERROR_Pos   19UL
#define CRYPTO_V2_INTR_TR_AP_DETECT_ERROR_Msk   0x80000UL
#define CRYPTO_V2_INTR_TR_RC_DETECT_ERROR_Pos   20UL
#define CRYPTO_V2_INTR_TR_RC_DETECT_ERROR_Msk   0x100000UL
#define CRYPTO_V2_INTR_INSTR_DEV_KEY_ERROR_Pos  21UL
#define CRYPTO_V2_INTR_INSTR_DEV_KEY_ERROR_Msk  0x200000UL
/* CRYPTO_V2.INTR_SET */
#define CRYPTO_V2_INTR_SET_INSTR_FF_LEVEL_Pos   0UL
#define CRYPTO_V2_INTR_SET_INSTR_FF_LEVEL_Msk   0x1UL
#define CRYPTO_V2_INTR_SET_INSTR_FF_OVERFLOW_Pos 1UL
#define CRYPTO_V2_INTR_SET_INSTR_FF_OVERFLOW_Msk 0x2UL
#define CRYPTO_V2_INTR_SET_TR_INITIALIZED_Pos   2UL
#define CRYPTO_V2_INTR_SET_TR_INITIALIZED_Msk   0x4UL
#define CRYPTO_V2_INTR_SET_TR_DATA_AVAILABLE_Pos 3UL
#define CRYPTO_V2_INTR_SET_TR_DATA_AVAILABLE_Msk 0x8UL
#define CRYPTO_V2_INTR_SET_PR_DATA_AVAILABLE_Pos 4UL
#define CRYPTO_V2_INTR_SET_PR_DATA_AVAILABLE_Msk 0x10UL
#define CRYPTO_V2_INTR_SET_INSTR_OPC_ERROR_Pos  16UL
#define CRYPTO_V2_INTR_SET_INSTR_OPC_ERROR_Msk  0x10000UL
#define CRYPTO_V2_INTR_SET_INSTR_CC_ERROR_Pos   17UL
#define CRYPTO_V2_INTR_SET_INSTR_CC_ERROR_Msk   0x20000UL
#define CRYPTO_V2_INTR_SET_BUS_ERROR_Pos        18UL
#define CRYPTO_V2_INTR_SET_BUS_ERROR_Msk        0x40000UL
#define CRYPTO_V2_INTR_SET_TR_AP_DETECT_ERROR_Pos 19UL
#define CRYPTO_V2_INTR_SET_TR_AP_DETECT_ERROR_Msk 0x80000UL
#define CRYPTO_V2_INTR_SET_TR_RC_DETECT_ERROR_Pos 20UL
#define CRYPTO_V2_INTR_SET_TR_RC_DETECT_ERROR_Msk 0x100000UL
#define CRYPTO_V2_INTR_SET_INSTR_DEV_KEY_ERROR_Pos 21UL
#define CRYPTO_V2_INTR_SET_INSTR_DEV_KEY_ERROR_Msk 0x200000UL
/* CRYPTO_V2.INTR_MASK */
#define CRYPTO_V2_INTR_MASK_INSTR_FF_LEVEL_Pos  0UL
#define CRYPTO_V2_INTR_MASK_INSTR_FF_LEVEL_Msk  0x1UL
#define CRYPTO_V2_INTR_MASK_INSTR_FF_OVERFLOW_Pos 1UL
#define CRYPTO_V2_INTR_MASK_INSTR_FF_OVERFLOW_Msk 0x2UL
#define CRYPTO_V2_INTR_MASK_TR_INITIALIZED_Pos  2UL
#define CRYPTO_V2_INTR_MASK_TR_INITIALIZED_Msk  0x4UL
#define CRYPTO_V2_INTR_MASK_TR_DATA_AVAILABLE_Pos 3UL
#define CRYPTO_V2_INTR_MASK_TR_DATA_AVAILABLE_Msk 0x8UL
#define CRYPTO_V2_INTR_MASK_PR_DATA_AVAILABLE_Pos 4UL
#define CRYPTO_V2_INTR_MASK_PR_DATA_AVAILABLE_Msk 0x10UL
#define CRYPTO_V2_INTR_MASK_INSTR_OPC_ERROR_Pos 16UL
#define CRYPTO_V2_INTR_MASK_INSTR_OPC_ERROR_Msk 0x10000UL
#define CRYPTO_V2_INTR_MASK_INSTR_CC_ERROR_Pos  17UL
#define CRYPTO_V2_INTR_MASK_INSTR_CC_ERROR_Msk  0x20000UL
#define CRYPTO_V2_INTR_MASK_BUS_ERROR_Pos       18UL
#define CRYPTO_V2_INTR_MASK_BUS_ERROR_Msk       0x40000UL
#define CRYPTO_V2_INTR_MASK_TR_AP_DETECT_ERROR_Pos 19UL
#define CRYPTO_V2_INTR_MASK_TR_AP_DETECT_ERROR_Msk 0x80000UL
#define CRYPTO_V2_INTR_MASK_TR_RC_DETECT_ERROR_Pos 20UL
#define CRYPTO_V2_INTR_MASK_TR_RC_DETECT_ERROR_Msk 0x100000UL
#define CRYPTO_V2_INTR_MASK_INSTR_DEV_KEY_ERROR_Pos 21UL
#define CRYPTO_V2_INTR_MASK_INSTR_DEV_KEY_ERROR_Msk 0x200000UL
/* CRYPTO_V2.INTR_MASKED */
#define CRYPTO_V2_INTR_MASKED_INSTR_FF_LEVEL_Pos 0UL
#define CRYPTO_V2_INTR_MASKED_INSTR_FF_LEVEL_Msk 0x1UL
#define CRYPTO_V2_INTR_MASKED_INSTR_FF_OVERFLOW_Pos 1UL
#define CRYPTO_V2_INTR_MASKED_INSTR_FF_OVERFLOW_Msk 0x2UL
#define CRYPTO_V2_INTR_MASKED_TR_INITIALIZED_Pos 2UL
#define CRYPTO_V2_INTR_MASKED_TR_INITIALIZED_Msk 0x4UL
#define CRYPTO_V2_INTR_MASKED_TR_DATA_AVAILABLE_Pos 3UL
#define CRYPTO_V2_INTR_MASKED_TR_DATA_AVAILABLE_Msk 0x8UL
#define CRYPTO_V2_INTR_MASKED_PR_DATA_AVAILABLE_Pos 4UL
#define CRYPTO_V2_INTR_MASKED_PR_DATA_AVAILABLE_Msk 0x10UL
#define CRYPTO_V2_INTR_MASKED_INSTR_OPC_ERROR_Pos 16UL
#define CRYPTO_V2_INTR_MASKED_INSTR_OPC_ERROR_Msk 0x10000UL
#define CRYPTO_V2_INTR_MASKED_INSTR_CC_ERROR_Pos 17UL
#define CRYPTO_V2_INTR_MASKED_INSTR_CC_ERROR_Msk 0x20000UL
#define CRYPTO_V2_INTR_MASKED_BUS_ERROR_Pos     18UL
#define CRYPTO_V2_INTR_MASKED_BUS_ERROR_Msk     0x40000UL
#define CRYPTO_V2_INTR_MASKED_TR_AP_DETECT_ERROR_Pos 19UL
#define CRYPTO_V2_INTR_MASKED_TR_AP_DETECT_ERROR_Msk 0x80000UL
#define CRYPTO_V2_INTR_MASKED_TR_RC_DETECT_ERROR_Pos 20UL
#define CRYPTO_V2_INTR_MASKED_TR_RC_DETECT_ERROR_Msk 0x100000UL
#define CRYPTO_V2_INTR_MASKED_INSTR_DEV_KEY_ERROR_Pos 21UL
#define CRYPTO_V2_INTR_MASKED_INSTR_DEV_KEY_ERROR_Msk 0x200000UL
/* CRYPTO_V2.PR_LFSR_CTL0 */
#define CRYPTO_V2_PR_LFSR_CTL0_LFSR32_Pos       0UL
#define CRYPTO_V2_PR_LFSR_CTL0_LFSR32_Msk       0xFFFFFFFFUL
/* CRYPTO_V2.PR_LFSR_CTL1 */
#define CRYPTO_V2_PR_LFSR_CTL1_LFSR31_Pos       0UL
#define CRYPTO_V2_PR_LFSR_CTL1_LFSR31_Msk       0x7FFFFFFFUL
/* CRYPTO_V2.PR_LFSR_CTL2 */
#define CRYPTO_V2_PR_LFSR_CTL2_LFSR29_Pos       0UL
#define CRYPTO_V2_PR_LFSR_CTL2_LFSR29_Msk       0x1FFFFFFFUL
/* CRYPTO_V2.PR_MAX_CTL */
#define CRYPTO_V2_PR_MAX_CTL_DATA32_Pos         0UL
#define CRYPTO_V2_PR_MAX_CTL_DATA32_Msk         0xFFFFFFFFUL
/* CRYPTO_V2.PR_CMD */
#define CRYPTO_V2_PR_CMD_START_Pos              0UL
#define CRYPTO_V2_PR_CMD_START_Msk              0x1UL
/* CRYPTO_V2.PR_RESULT */
#define CRYPTO_V2_PR_RESULT_DATA32_Pos          0UL
#define CRYPTO_V2_PR_RESULT_DATA32_Msk          0xFFFFFFFFUL
/* CRYPTO_V2.TR_CTL0 */
#define CRYPTO_V2_TR_CTL0_SAMPLE_CLOCK_DIV_Pos  0UL
#define CRYPTO_V2_TR_CTL0_SAMPLE_CLOCK_DIV_Msk  0xFFUL
#define CRYPTO_V2_TR_CTL0_RED_CLOCK_DIV_Pos     8UL
#define CRYPTO_V2_TR_CTL0_RED_CLOCK_DIV_Msk     0xFF00UL
#define CRYPTO_V2_TR_CTL0_INIT_DELAY_Pos        16UL
#define CRYPTO_V2_TR_CTL0_INIT_DELAY_Msk        0xFF0000UL
#define CRYPTO_V2_TR_CTL0_VON_NEUMANN_CORR_Pos  24UL
#define CRYPTO_V2_TR_CTL0_VON_NEUMANN_CORR_Msk  0x1000000UL
#define CRYPTO_V2_TR_CTL0_STOP_ON_AP_DETECT_Pos 28UL
#define CRYPTO_V2_TR_CTL0_STOP_ON_AP_DETECT_Msk 0x10000000UL
#define CRYPTO_V2_TR_CTL0_STOP_ON_RC_DETECT_Pos 29UL
#define CRYPTO_V2_TR_CTL0_STOP_ON_RC_DETECT_Msk 0x20000000UL
/* CRYPTO_V2.TR_CTL1 */
#define CRYPTO_V2_TR_CTL1_RO11_EN_Pos           0UL
#define CRYPTO_V2_TR_CTL1_RO11_EN_Msk           0x1UL
#define CRYPTO_V2_TR_CTL1_RO15_EN_Pos           1UL
#define CRYPTO_V2_TR_CTL1_RO15_EN_Msk           0x2UL
#define CRYPTO_V2_TR_CTL1_GARO15_EN_Pos         2UL
#define CRYPTO_V2_TR_CTL1_GARO15_EN_Msk         0x4UL
#define CRYPTO_V2_TR_CTL1_GARO31_EN_Pos         3UL
#define CRYPTO_V2_TR_CTL1_GARO31_EN_Msk         0x8UL
#define CRYPTO_V2_TR_CTL1_FIRO15_EN_Pos         4UL
#define CRYPTO_V2_TR_CTL1_FIRO15_EN_Msk         0x10UL
#define CRYPTO_V2_TR_CTL1_FIRO31_EN_Pos         5UL
#define CRYPTO_V2_TR_CTL1_FIRO31_EN_Msk         0x20UL
/* CRYPTO_V2.TR_CTL2 */
#define CRYPTO_V2_TR_CTL2_SIZE_Pos              0UL
#define CRYPTO_V2_TR_CTL2_SIZE_Msk              0x3FUL
/* CRYPTO_V2.TR_STATUS */
#define CRYPTO_V2_TR_STATUS_INITIALIZED_Pos     0UL
#define CRYPTO_V2_TR_STATUS_INITIALIZED_Msk     0x1UL
/* CRYPTO_V2.TR_CMD */
#define CRYPTO_V2_TR_CMD_START_Pos              0UL
#define CRYPTO_V2_TR_CMD_START_Msk              0x1UL
/* CRYPTO_V2.TR_RESULT */
#define CRYPTO_V2_TR_RESULT_DATA32_Pos          0UL
#define CRYPTO_V2_TR_RESULT_DATA32_Msk          0xFFFFFFFFUL
/* CRYPTO_V2.TR_GARO_CTL */
#define CRYPTO_V2_TR_GARO_CTL_POLYNOMIAL31_Pos  0UL
#define CRYPTO_V2_TR_GARO_CTL_POLYNOMIAL31_Msk  0x7FFFFFFFUL
/* CRYPTO_V2.TR_FIRO_CTL */
#define CRYPTO_V2_TR_FIRO_CTL_POLYNOMIAL31_Pos  0UL
#define CRYPTO_V2_TR_FIRO_CTL_POLYNOMIAL31_Msk  0x7FFFFFFFUL
/* CRYPTO_V2.TR_MON_CTL */
#define CRYPTO_V2_TR_MON_CTL_BITSTREAM_SEL_Pos  0UL
#define CRYPTO_V2_TR_MON_CTL_BITSTREAM_SEL_Msk  0x3UL
/* CRYPTO_V2.TR_MON_CMD */
#define CRYPTO_V2_TR_MON_CMD_START_AP_Pos       0UL
#define CRYPTO_V2_TR_MON_CMD_START_AP_Msk       0x1UL
#define CRYPTO_V2_TR_MON_CMD_START_RC_Pos       1UL
#define CRYPTO_V2_TR_MON_CMD_START_RC_Msk       0x2UL
/* CRYPTO_V2.TR_MON_RC_CTL */
#define CRYPTO_V2_TR_MON_RC_CTL_CUTOFF_COUNT8_Pos 0UL
#define CRYPTO_V2_TR_MON_RC_CTL_CUTOFF_COUNT8_Msk 0xFFUL
/* CRYPTO_V2.TR_MON_RC_STATUS0 */
#define CRYPTO_V2_TR_MON_RC_STATUS0_BIT_Pos     0UL
#define CRYPTO_V2_TR_MON_RC_STATUS0_BIT_Msk     0x1UL
/* CRYPTO_V2.TR_MON_RC_STATUS1 */
#define CRYPTO_V2_TR_MON_RC_STATUS1_REP_COUNT_Pos 0UL
#define CRYPTO_V2_TR_MON_RC_STATUS1_REP_COUNT_Msk 0xFFUL
/* CRYPTO_V2.TR_MON_AP_CTL */
#define CRYPTO_V2_TR_MON_AP_CTL_CUTOFF_COUNT16_Pos 0UL
#define CRYPTO_V2_TR_MON_AP_CTL_CUTOFF_COUNT16_Msk 0xFFFFUL
#define CRYPTO_V2_TR_MON_AP_CTL_WINDOW_SIZE_Pos 16UL
#define CRYPTO_V2_TR_MON_AP_CTL_WINDOW_SIZE_Msk 0xFFFF0000UL
/* CRYPTO_V2.TR_MON_AP_STATUS0 */
#define CRYPTO_V2_TR_MON_AP_STATUS0_BIT_Pos     0UL
#define CRYPTO_V2_TR_MON_AP_STATUS0_BIT_Msk     0x1UL
/* CRYPTO_V2.TR_MON_AP_STATUS1 */
#define CRYPTO_V2_TR_MON_AP_STATUS1_OCC_COUNT_Pos 0UL
#define CRYPTO_V2_TR_MON_AP_STATUS1_OCC_COUNT_Msk 0xFFFFUL
#define CRYPTO_V2_TR_MON_AP_STATUS1_WINDOW_INDEX_Pos 16UL
#define CRYPTO_V2_TR_MON_AP_STATUS1_WINDOW_INDEX_Msk 0xFFFF0000UL
/* CRYPTO_V2.STATUS */
#define CRYPTO_V2_STATUS_BUSY_Pos               31UL
#define CRYPTO_V2_STATUS_BUSY_Msk               0x80000000UL
/* CRYPTO_V2.INSTR_FF_CTL */
#define CRYPTO_V2_INSTR_FF_CTL_EVENT_LEVEL_Pos  0UL
#define CRYPTO_V2_INSTR_FF_CTL_EVENT_LEVEL_Msk  0x7UL
#define CRYPTO_V2_INSTR_FF_CTL_CLEAR_Pos        16UL
#define CRYPTO_V2_INSTR_FF_CTL_CLEAR_Msk        0x10000UL
#define CRYPTO_V2_INSTR_FF_CTL_BLOCK_Pos        17UL
#define CRYPTO_V2_INSTR_FF_CTL_BLOCK_Msk        0x20000UL
/* CRYPTO_V2.INSTR_FF_STATUS */
#define CRYPTO_V2_INSTR_FF_STATUS_USED_Pos      0UL
#define CRYPTO_V2_INSTR_FF_STATUS_USED_Msk      0xFUL
#define CRYPTO_V2_INSTR_FF_STATUS_EVENT_Pos     16UL
#define CRYPTO_V2_INSTR_FF_STATUS_EVENT_Msk     0x10000UL
/* CRYPTO_V2.INSTR_FF_WR */
#define CRYPTO_V2_INSTR_FF_WR_DATA32_Pos        0UL
#define CRYPTO_V2_INSTR_FF_WR_DATA32_Msk        0xFFFFFFFFUL
/* CRYPTO_V2.LOAD0_FF_STATUS */
#define CRYPTO_V2_LOAD0_FF_STATUS_USED5_Pos     0UL
#define CRYPTO_V2_LOAD0_FF_STATUS_USED5_Msk     0x1FUL
#define CRYPTO_V2_LOAD0_FF_STATUS_BUSY_Pos      31UL
#define CRYPTO_V2_LOAD0_FF_STATUS_BUSY_Msk      0x80000000UL
/* CRYPTO_V2.LOAD1_FF_STATUS */
#define CRYPTO_V2_LOAD1_FF_STATUS_USED5_Pos     0UL
#define CRYPTO_V2_LOAD1_FF_STATUS_USED5_Msk     0x1FUL
#define CRYPTO_V2_LOAD1_FF_STATUS_BUSY_Pos      31UL
#define CRYPTO_V2_LOAD1_FF_STATUS_BUSY_Msk      0x80000000UL
/* CRYPTO_V2.STORE_FF_STATUS */
#define CRYPTO_V2_STORE_FF_STATUS_USED5_Pos     0UL
#define CRYPTO_V2_STORE_FF_STATUS_USED5_Msk     0x1FUL
#define CRYPTO_V2_STORE_FF_STATUS_BUSY_Pos      31UL
#define CRYPTO_V2_STORE_FF_STATUS_BUSY_Msk      0x80000000UL
/* CRYPTO_V2.AES_CTL */
#define CRYPTO_V2_AES_CTL_KEY_SIZE_Pos          0UL
#define CRYPTO_V2_AES_CTL_KEY_SIZE_Msk          0x3UL
/* CRYPTO_V2.RESULT */
#define CRYPTO_V2_RESULT_DATA_Pos               0UL
#define CRYPTO_V2_RESULT_DATA_Msk               0xFFFFFFFFUL
/* CRYPTO_V2.CRC_CTL */
#define CRYPTO_V2_CRC_CTL_DATA_REVERSE_Pos      0UL
#define CRYPTO_V2_CRC_CTL_DATA_REVERSE_Msk      0x1UL
#define CRYPTO_V2_CRC_CTL_REM_REVERSE_Pos       8UL
#define CRYPTO_V2_CRC_CTL_REM_REVERSE_Msk       0x100UL
/* CRYPTO_V2.CRC_DATA_CTL */
#define CRYPTO_V2_CRC_DATA_CTL_DATA_XOR_Pos     0UL
#define CRYPTO_V2_CRC_DATA_CTL_DATA_XOR_Msk     0xFFUL
/* CRYPTO_V2.CRC_POL_CTL */
#define CRYPTO_V2_CRC_POL_CTL_POLYNOMIAL_Pos    0UL
#define CRYPTO_V2_CRC_POL_CTL_POLYNOMIAL_Msk    0xFFFFFFFFUL
/* CRYPTO_V2.CRC_REM_CTL */
#define CRYPTO_V2_CRC_REM_CTL_REM_XOR_Pos       0UL
#define CRYPTO_V2_CRC_REM_CTL_REM_XOR_Msk       0xFFFFFFFFUL
/* CRYPTO_V2.CRC_REM_RESULT */
#define CRYPTO_V2_CRC_REM_RESULT_REM_Pos        0UL
#define CRYPTO_V2_CRC_REM_RESULT_REM_Msk        0xFFFFFFFFUL
/* CRYPTO_V2.VU_CTL0 */
#define CRYPTO_V2_VU_CTL0_ALWAYS_EXECUTE_Pos    0UL
#define CRYPTO_V2_VU_CTL0_ALWAYS_EXECUTE_Msk    0x1UL
/* CRYPTO_V2.VU_CTL1 */
#define CRYPTO_V2_VU_CTL1_ADDR24_Pos            8UL
#define CRYPTO_V2_VU_CTL1_ADDR24_Msk            0xFFFFFF00UL
/* CRYPTO_V2.VU_CTL2 */
#define CRYPTO_V2_VU_CTL2_MASK_Pos              8UL
#define CRYPTO_V2_VU_CTL2_MASK_Msk              0x7F00UL
/* CRYPTO_V2.VU_STATUS */
#define CRYPTO_V2_VU_STATUS_CARRY_Pos           0UL
#define CRYPTO_V2_VU_STATUS_CARRY_Msk           0x1UL
#define CRYPTO_V2_VU_STATUS_EVEN_Pos            1UL
#define CRYPTO_V2_VU_STATUS_EVEN_Msk            0x2UL
#define CRYPTO_V2_VU_STATUS_ZERO_Pos            2UL
#define CRYPTO_V2_VU_STATUS_ZERO_Msk            0x4UL
#define CRYPTO_V2_VU_STATUS_ONE_Pos             3UL
#define CRYPTO_V2_VU_STATUS_ONE_Msk             0x8UL
/* CRYPTO_V2.VU_RF_DATA */
#define CRYPTO_V2_VU_RF_DATA_DATA32_Pos         0UL
#define CRYPTO_V2_VU_RF_DATA_DATA32_Msk         0xFFFFFFFFUL
/* CRYPTO_V2.DEV_KEY_ADDR0_CTL */
#define CRYPTO_V2_DEV_KEY_ADDR0_CTL_VALID_Pos   31UL
#define CRYPTO_V2_DEV_KEY_ADDR0_CTL_VALID_Msk   0x80000000UL
/* CRYPTO_V2.DEV_KEY_ADDR0 */
#define CRYPTO_V2_DEV_KEY_ADDR0_ADDR32_Pos      0UL
#define CRYPTO_V2_DEV_KEY_ADDR0_ADDR32_Msk      0xFFFFFFFFUL
/* CRYPTO_V2.DEV_KEY_ADDR1_CTL */
#define CRYPTO_V2_DEV_KEY_ADDR1_CTL_VALID_Pos   31UL
#define CRYPTO_V2_DEV_KEY_ADDR1_CTL_VALID_Msk   0x80000000UL
/* CRYPTO_V2.DEV_KEY_ADDR1 */
#define CRYPTO_V2_DEV_KEY_ADDR1_ADDR32_Pos      0UL
#define CRYPTO_V2_DEV_KEY_ADDR1_ADDR32_Msk      0xFFFFFFFFUL
/* CRYPTO_V2.DEV_KEY_STATUS */
#define CRYPTO_V2_DEV_KEY_STATUS_LOADED_Pos     0UL
#define CRYPTO_V2_DEV_KEY_STATUS_LOADED_Msk     0x1UL
/* CRYPTO_V2.DEV_KEY_CTL0 */
#define CRYPTO_V2_DEV_KEY_CTL0_ALLOWED_Pos      0UL
#define CRYPTO_V2_DEV_KEY_CTL0_ALLOWED_Msk      0x1UL
/* CRYPTO_V2.DEV_KEY_CTL1 */
#define CRYPTO_V2_DEV_KEY_CTL1_ALLOWED_Pos      0UL
#define CRYPTO_V2_DEV_KEY_CTL1_ALLOWED_Msk      0x1UL
/* CRYPTO_V2.MEM_BUFF */
#define CRYPTO_V2_MEM_BUFF_DATA32_Pos           0UL
#define CRYPTO_V2_MEM_BUFF_DATA32_Msk           0xFFFFFFFFUL


#endif /* _CYIP_CRYPTO_V2_1_H_ */


/* [] END OF FILE */
